CREATE TABLE IF NOT EXISTS book(
	b_id VARCHAR(10) NOT NULL,
	b_name VARCHAR(20),
	b_unitPrice INTEGER,
	b_author VARCHAR(20),
	b_description TEXT,
	b_publisher VARCHAR(20),
	b_category VARCHAR(20),
	b_unitsInStock LONG,
	b_releaseDate VARCHAR(20),
	b_condition VARCHAR(20),
	b_fileName VARCHAR(20),
	PRIMARY KEY (b_id)
) default CHARSET=utf8;


INSERT INTO book VALUES('ISBN0001', '2084', 17800, '조남호', '『2084』는 냉혹한 미래사회의 풍경을 통해 인간성과 존재의 의미를 되묻는 SF 디스토피아 서사이다. 모든 것이 데이터화되고, 인간과 로봇의 경계가 희미해진 시대 2084년. 로봇이 수거하고 폐기되는 세계의 한복판에서 한 운전기사 로봇 아큐가 살아있는 기억을 안고 묵묵히 하루하루를 살아간다. 이야기는 금 거래소에서 벌어지는 총격 사건으로 시작된다. 그리고 그 현장에 있었던 로봇 아큐는 부이라는 동료와 함께 거대한 폐기물 수송 시스템의 일원이 되어 매일같이 무언가를 나르고 버린다. 인간의 감정에 가까운 감성을 가진 이 로봇들은 반복되는 일상 속에서 누군가의 죽음을 목격하고, 어떤 존재의 구원을 감행하며, 폐기물 속에서 불렛이라 불리는 신형 로봇을 구해 낸다. 『2084』는 단순한 미래 기술의 예언이 아니라, 고요한 절망 속에서 피어나는 연대와 구원의 이야기다. 사회 시스템에 의해 재활용 불가한 존재로 규정된 로봇과 인간의 잔혹한 서사를 통해, 독자는 무심히 지나치는 오늘의 사회를 정면으로 바라보게 될 것이다.', '블루문파크', 'SF/과학소설', 1000,  '2025/07/01', 'new', 'ISBN0001.jpg');
INSERT INTO book VALUES('ISBN0002', '불편한 편의점(벚꽃 에디션)', 16800, '김호연', '원 플러스 원의 기쁨, 삼각김밥 모양의 슬픔, 만 원에 네 번의 폭소가 터지는 곳! 힘겨운 시대를 살아가는 우리들에게 다가온 조금 특별한 편의점 이야기, 서울역에서 노숙인 생활을 하던 독고라는 남자가 어느 날 70대 여성의 지갑을 주워준 인연으로 그녀가 운영하는 편의점에서 야간 알바를 하면서 이야기가 시작된다. 덩치가 곰 같은 이 사내는 알코올성 치매로 과거를 기억하지 못하는 데다 말도 어눌하고 행동도 굼떠 과연 손님을 제대로 상대할 수 있을까 의구심을 갖게 하는데 웬걸, 의외로 그는 일을 꽤 잘해낼 뿐 아니라 주변 사람들을 묘하게 사로잡으면서 편의점의 밤을 지키는 든든한 일꾼이 되어간다.', '나무옆의자', '한국소설',1000, '2021/04/20', 'new', 'ISBN0002.jpg');
INSERT INTO book VALUES('ISBN0003', '작은 별이지만 빛나고 있어', 19000, '소윤', '2021년 최장 기간 동안 에세이 베스트 셀러 자리를 지킨 『작은 별이지만 빛나고 있어』가 20만 부를 기념하여 인기 일러스트레이터 제딧 작가와 협업한 리커버 에디션으로 돌아왔다. 마음을 울리는 색채와 환상적인 분위기가 매력적인 제딧 작가만의 그림이 소윤 작가의 따뜻한 토닥임과 부드럽게 어우러진다. 이 책은 누구나 품고 있는 꿈과 희망, 작은 소망과 연결되는 ‘작은 별’을 꺼내 볼 수 있는 시간과 여운을 주며, 상처받았던 과거와 아직 성장하고 있는 이야기들을 통해 많은 독자의 공감을 얻고 있다. 평범해 보이는 각자의 일상도 사실은 작은 별처럼 빛나고 있음을 깨닫는 순간을 마주하고 싶다면, ‘별이 빛나는 밤’ 에디션을 펼쳐보자. 아직 그저 그런 평범한 일상의 연속이라고 생각하는 순간이야말로 마음속 꺼내지 않은 작은 별을 들여다보아야 할 때다.', '북로망스', '에세이',1000, '2021/09/29', 'new', 'ISBN0003.jpg');
INSERT INTO book VALUES('ISBN0004', '딸에게 보내는 굿나잇 키스', 17000, '이어령', '약 10년에 가까운 시간이 흐른 지금 암 투병 중인 이어령 교수가 딸을 생각하며 서문을 다시 썼다. 초판에서 한 부를 차지했던 시들이 빠지고 따듯한 삽화와 함께 1, 2부 모두 편지글로만 묶었다. 1부에는 떠나간 딸에게 전하는 아버지 이어령의 말이, 2부에는 고(故) 이민아 목사와 생전 주고받은 편지들이 실렸다. 사랑하는 딸을 보내고 이어령 교수는 세상 모든 딸과 아버지, 그리고 사랑하는 사람을 잃은 모든 이를 위로하려는 마음으로 이 책의 초고를 썼다. 굿나잇 키스를 기대하며 서재 앞을 서성이던 딸을 안아주지 못한 일, 미용실에서 깜빡 잠이 들어 딸의 신부 입장을 늦춘 일, 떠나기 며칠 전 딸이 호텔에서 하룻밤을 더 묵어도 될지 조심스레 묻던 일……. 애도를 위해 딸의 생애를 되짚어보던 저자는 미숙했던 아버지로서 미처 전하지 못한 사랑에 관해 털어놓는다. 죽음은 그 자체로 종결이 아니고 또 다른 시작, 탄생을 의미한다. 병마와 사투하며 저자에게 죽음의 개념은 더욱 구체적이고 사실적으로 드러나지만 딸이 보여주었듯 그것이 허무요 끝은 아니다. 저자는 스스로에게, 딸에게, 상실을 견디는 또 다른 모든 이에게 이야기한다. ‘이제 마음 놓고 울어도 된다’고. 우리의 이별은 또 새로운 만남이 될 것이기에.기들을 통해 많은 독자의 공감을 얻고 있다. 평범해 보이는 각자의 일상도 사실은 작은 별처럼 빛나고 있음을 깨닫는 순간을 마주하고 싶다면, ‘별이 빛나는 밤’ 에디션을 펼쳐보자. 아직 그저 그런 평범한 일상의 연속이라고 생각하는 순간이야말로 마음속 꺼내지 않은 작은 별을 들여다보아야 할 때다.', '열림원', '에세이',1000, '2021/03/15', 'new', 'ISBN0004.jpg');
INSERT INTO book VALUES('ISBN0005', '천 개의 파랑', 17000, '천선란', '오늘날 전 세계 독자가 사랑하는 “우리의 가장 따듯한 SF”, 천선란 작가는 2019년 장편소설 『무너진 다리』를 출간하며 데뷔했으며, 『천 개의 파랑』으로 제4회 한국과학문학상 장편 대상을 수상하며 본격적으로 작품 활동을 시작했다. 『천 개의 파랑』은 출간 이후 독자와 평단의 주목을 받았는데, 2021년 매일경제·교보문고 〈2021년을 여는 책〉에 선정되었을 뿐만 아니라, 소설가 최진영, 영화감독 민규동, 배우 손수현 등 여러 아티스트들의 찬사를 받으며 전 영역에서 뜨거운 관심을 받았다. 이후 문학뿐 아니라 공연과 영화 분야에서도 주목을 받았는데, 2024년 국립극단과 서울예술단에서 각각 연극과 창작가무극으로 제작되어 무대에 올랐으며, 특히 창작가무극은 관객들의 성원에 힘입어 2025년 재공연되었다. 최근 세계 3대 영화사인 워너 브라더스 픽쳐스와 영화화 판권 계약을 체결하며 스크린 진출을 앞두고 있다. 『천 개의 파랑』은 20만 부가 판매되었으며, 미국 펭귄 랜덤하우스를 포함한 10여 개국에 판권이 수출되었다. 현재까지 일본·독일·대만·중국·영국에서 출간되어 해외 팬들의 사랑을 받고 있다.', '허블', 'SF/과학소설',1000, '2020/08/19', 'new', 'ISBN0005.jpg');
INSERT INTO book VALUES('ISBN0006', '어느 날 서점 주인이 되었습니다', 13000, '페트라 하르틀리프', '행복한 서점 주인으로 살아간다는 것, 가족과 함께 서점을 운영하며 서점 2층에서 살고 있는 저자 페트라 하르틀리프. 그녀가 자신의 서점을 운영하게 된 계기는 남편과 함께 떠난 휴가에서 떠오른 엉뚱하기 짝이 없는 생각 하나 때문이었다. 곧바로 오스트리아 빈에 있는 막 폐업한 유서 깊은 서점을 인수하게 된 그녀는 하룻밤 사이에 다니던 직장을 그만두고, 가족과 함께 새로운 도시에서 새로운 삶을 시작한다. 어떻게 될 지도 모른 채 말이다. 단골이 친구가 되고 친구가 단골이 되는, 가족을 위한 거실이자 이웃이 서로 만나는 사랑방이 되어주는 그녀의 서점. 『어느 날 서점 주인이 되었습니다』는 자신감과 책에 대한 넘치는 열정을 지닌 저자 페트라 하르틀리프가 자신이 운영하는 서점의 이야기를 담아낸 책이다. 한 줄 한 줄 큰 기쁨을 만들어주는 적절하고도 유머 넘치는 문체로 매 장마다 책 세상에 대한 애정 어린 이야기를 오롯이 보여준다.', '솔빛길', '에세이',1000, '2015/08/14', 'new', 'ISBN0006.jpg');


select * from book;
drop table book;

